"""alfa = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i',
        'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r',
        's', 't', 'u', 'v', 'w', 'x', 'y', 'z']"""

#ანბანი
alfa = ['ა', 'ბ', 'გ', 'დ', 'ე', 'ვ', 'ზ', 'თ', 'ი',
        'კ', 'ლ', 'მ', 'ნ', 'ო', 'პ', 'ჟ', 'რ', 'ს',
        'ტ','უ', 'ფ', 'ქ', 'ღ', 'ყ', 'შ', 'ჩ', 'ც',
        'ძ', 'წ', 'ჭ', 'ხ', 'ჯ', 'ჰ']

txt = str(input('[ შეიყვანეთ ტექსტი ] ')) #ტექსტის შესაყვანი ველი
res = '' # ცარიელი სტრიქონი
for i in txt: # შეყვანილ ტექსტს ვანაწილებთ სიმბოლოებად
    index = alfa.index(i) # ანაბნში ვეძებთ ტექსტის დანაწევრებული სიმბლოებით
    gg = (index * 3 + 2) % 26 # მათ ინდექსების მიხედვით ვითვლით ამ მაგალითს
    res += alfa[gg] # ცარიელ სტრიქონს ვამატებთ დანაწევრებულ სიმბოლოებს მთლიანი ტექსტის შესადგენად
print('\n [ დასაშიფრი ტექსტი ] ' + res)

# იმავე ოპერაციას ვაკეთბთ რაც ზემოთ დეშიფრაციისთვის
tel = ''
for j in txt:
    ind = alfa.index(j)
    g = ((ind - 3) * 9) % 26
    tel += alfa[g]
print('\n [ დეშიფრაციისას მიღებული ტექსტი ] : ' + tel)
